#ifndef RUSSIAN_NAMES_H
#define RUSSIAN_NAMES_H

#include <string>

const static int countRussianFirstNames = 120;
const static int countRussiansurnames = 110;
const static int countRussianPatronymics = 100;

const static std::string russianFirstNames[countRussianFirstNames] = {
        "Александр", "Максим", "Иван", "Артем", "Дмитрий", "Никита", "Михаил", "Даниил", "Егор", "Андрей",
        "Илья", "Алексей", "Кирилл", "Владимир", "Павел", "Роман", "Сергей", "Олег", "Тимофей", "Юрий",
        "Виктор", "Евгений", "Георгий", "Константин", "Николай", "Семен", "Антон", "Степан", "Анатолий", "Федор",
        "Борис", "Виталий", "Василий", "Владислав", "Леонид", "Геннадий", "Аркадий", "Григорий", "Валентин", "Глеб",
        "Денис", "Вячеслав", "Станислав", "Ярослав", "Захар", "Матвей", "Тарас", "Савелий", "Альберт", "Филипп",
        "Игнат", "Эдуард", "Ростислав", "Давид", "Мирон", "Валерий", "Марк", "Прохор", "Арсений", "Родион",
        "Юлиан", "Артемий", "Тимур", "Амир", "Игорь", "Лазарь", "Рубен", "Назар", "Макар", "Ратмир",
        "Марат", "Лев", "Оскар", "Самуил", "Ренат", "Серафим", "Тихон", "Эмиль", "Гордей", "Платон",
        "Петр", "Фома", "Клим", "Елисей", "Трофим", "Юлий", "Данил", "Савва", "Леонтий", "Арсен",
        "Игнатий", "Демьян", "Модест", "Еремей", "Онуфрий", "Гавриил", "Исаак", "Авраам", "Фадей", "Ефрем",
        "Акакий", "Виссарион", "Каллистрат", "Ипатий", "Андрон", "Панкратий", "Варфоломей", "Прокл", "Киприан", "Тихон",
        "Серафим", "Августин", "Ариан", "Трофим", "Клавдий", "Эразм", "Андроник", "Оливер", "Рикард", "Феликс"
};

const static std::string russiansurnames[countRussiansurnames] = {
        "Иванов", "Петров", "Сидоров", "Кузнецов", "Смирнов", "Попов", "Васильев", "Соколов", "Михайлов", "Новиков",
        "Федоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов",
        "Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев",
        "Григорьев", "Романов", "Воробьев", "Сергеев", "Фомин", "Виноградов", "Кузьмин", "Максимов", "Киселев", "Маркелов",
        "Медведев", "Анисимов", "Громов", "Суханов", "Маслов", "Шестаков", "Миронов", "Лобанов", "Карпов", "Афанасьев",
        "Власов", "Мельников", "Данилов", "Савельев", "Шестаков", "Львов", "Титов", "Дмитриев", "Калинин", "Рожков",
        "Зимин", "Никифоров", "Гончаров", "Ефимов", "Крылов", "Белов", "Молчанов", "Герасимов", "Фролов", "Сафонов",
        "Котов", "Гаврилов", "Ситников", "Тарасов", "Коновалов", "Буров", "Рыбаков", "Харитонов", "Зубков", "Корнилов",
        "Абрамов", "Беляков", "Кулагин", "Ильин", "Буров", "Трифонов", "Анисимов", "Климов", "Шаров", "Зорин",
        "Пахомов", "Субботин", "Яшин", "Корнеев", "Дегтярёв", "Глухов", "Головин", "Кривцов", "Ткачёв", "Рахимов",
        "Филиппов", "Туров", "Платонов", "Грачев", "Бондарев", "Гусаров", "Петухов", "Болдырев", "Гарин", "Кривошеев"
};

const static std::string russianPatronymics[countRussianPatronymics] = {
        "Александрович", "Михайлович", "Иванович", "Петрович", "Дмитриевич", "Алексеевич", "Сергеевич", "Васильевич",
        "Андреевич", "Юрьевич", "Федорович", "Олегович", "Николаевич", "Геннадиевич", "Егорович", "Павлович", "Максимович",
        "Ильич", "Степанович", "Григорьевич", "Викторович", "Константинович", "Аркадьевич", "Тимофеевич", "Владимирович",
        "Валентинович", "Валерьевич", "Романович", "Антонович", "Семенович", "Станиславович", "Ярославович", "Евгеньевич",
        "Артемович", "Борисович", "Леонидович", "Тарасович", "Филиппович", "Даниилович", "Савельевич", "Рубенович",
        "Владиславович", "Глебович", "Платонович", "Захарович", "Филимонович", "Кириллович", "Давидович", "Арсеньевич",
        "Георгиевич", "Анатольевич", "Гаврилович", "Ярославич", "Лукич", "Фомич", "Тихонович", "Игнатьевич", "Елизарович",
        "Назарович", "Маркович", "Фадеевич", "Эдуардович", "Рустамович", "Аркадьевич", "Кузьмич", "Никитич", "Родионович",
        "Станиславович", "Феофанович", "Иосифович", "Софронович", "Максимович", "Леонович", "Емельянович", "Миронович",
        "Романович", "Захарьевич", "Тихонович", "Лаврентьевич", "Герасимович", "Владиславович", "Альбертович", "Бориславич",
        "Платонович", "Филиппович", "Семенович", "Александрович", "Дмитриевич", "Юрьевич", "Сергеевич", "Григорьевич",
        "Геннадиевич", "Леонидович", "Ефимович", "Игоревич", "Максимович", "Константинович", "Павлович", "Егорович", "Кузьмич"
};

#endif
